app/controllers/redirects_controller.rb

  def index
    url = Url.find_by_slug(params[:slug]).name
---
SELECT "urls".* FROM "urls" WHERE "urls"."slug" = $1 LIMIT $2  [["slug", "d2d994"], ["LIMIT", 1]]