app/controllers/urls_controller.rb

  def create
    url = Url.new permitted_params

    if url.save
---
INSERT INTO "urls" ("name", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "http://www.google.com"], ["slug", "d2d994"], ["created_at", "2022-12-14 17:53:13.276502"], ["updated_at", "2022-12-14 17:53:13.276502"]]